{
  "location_name": "Goa State Museum",
  "processed_reviews": 1035,
  "last_updated": "2025-06-11T02:11:57.253936",
  "summary": {
    "Architecture & Aesthetics": [
      "Grand main MG street building",
      "Satya Meva Jayate marble slab over the main door",
      "Lots of art and sculptures are there in the showcase",
      "Just random sculptures and pictures in a building that needs renovation",
      "Woodwork items, especially the pillars at the beginning",
      "Inlaid furniture from the Portuguese era",
      "Anciestary sculpures and dieties",
      "Well carved chariot",
      "Historical western printing machienes and rubberstamp pieces",
      "Stone art",
      "Unique collection of furniture",
      "Number if statues and hero stones",
      "Olden day typography related items",
      "Wooden bridge is very beautiful",
      "Bridge is beautifully planned",
      "Art is very good.",
      "Really old sculptures",
      "The place is small and it deserves better light and layout.",
      "Ground floor of this colonial building has several rooms containing various items on display.",
      "Wide range of collections of ancient scripts, coins, ancient furniture, apparels etc.",
      "Stone statues of Hindu Gods and Godesses",
      "Few good collections of old sculptures",
      "Furniture from portuguese time"
    ],
    "Staff, Guides & Management": [
      "Staff says thousands yet to be displayed articles lying within",
      "over staffed over security filled building",
      "Staff told us to come back at 14:00 due to their lunchbreak finishing then, even though they were clearly not doing anything.",
      "Not welcoming or professional behaviour.",
      "No fee for guide too.",
      "No guides to help you around.",
      "Security very arrogant.",
      "The guides are very knowledgeable and shared a ton of information.",
      "The only active protection was from the guy sat behind the counter who said: \"No touch!\"",
      "Museum staff were very good.",
      "The worst entry formalities where they ask for a government ID for every individual.",
      "Staff at the réception was a bit rude",
      "Those inside don't provide much information."
    ],
    "Amenities & Facilities": [
      "Western Music classes going on above floor",
      "They provide 2 language options to see museum.",
      "No explanations in the form of text or audio guide.",
      "No meaningful explanations about the displayed art; needs more archaeological context.",
      "No particular context or explanation provided for the items on display.",
      "Good, clean toilets"
    ],
    "Cleanliness & Maintenance": [
      "Needs caring proud citizens to force The Deciders to spend money on Museum of the State",
      "Ongoing maintenance and renovation at the actual location",
      "Could be better",
      "building that needs renovation",
      "Well maintained and clean place",
      "Must have renovation done",
      "Well maintained (though the outside look of the museum building looks very old).",
      "The museum needs renovation",
      "Walls are so dirty",
      "Needs a lot of maintenance.",
      "Needs a makeover",
      "Nothing is properly preserved and protected from the visitors.",
      "Poorly maintained"
    ],
    "Emotional Tone / Vibe": [
      "Awaken !",
      "Disappointed 😔",
      "Disappointed.",
      "Cool",
      "Eye feast for the artist",
      "Overall experience is good",
      "Good",
      "Great place",
      "Remarkable experience",
      "Worthwhile experience",
      "Not that great",
      "Time waste",
      "Excellent",
      "Pleasant",
      "Good",
      "Informative",
      "Positive",
      "Best",
      "Worth the visit",
      "Mediocre place",
      "Some interesting things to see",
      "Great experience",
      "Lovely",
      "It was the worst museum I visited in my life.",
      "That's a shame.",
      "A disappointment.",
      "Good experience",
      "Very good",
      "Worth of knowledge",
      "Definitely not worth the trouble.",
      "Avoid at all costs.",
      "Worth seeing if you are visiting in and around Panjim",
      "Not worth visiting",
      "Experience to indian history"
    ],
    "Historical or Cultural Significance": [
      "Museum of the State",
      "culture preservation display of artifacts",
      "Place to know see the ancient monuments",
      "The remains of Hindu culture in goa",
      "The few pieces kept from the different eras kept for tourists, give a glimpse into what the actual potential of the Museum could be",
      "The charm of seeing the history show pieces will come back once the Museum moves back to its original venue",
      "Goa has rich heritage and has undergone intense freedom struggle. But the museum sadly doesn't reflect it.",
      "Limited artifacts pre portuguese invasion and post invasion",
      "For a state museum there was very minimal information",
      "Sati stones commemorating women who committed suicide on their husband's funeral pyre",
      "Gives idea about rich portuguese culturals of goa.",
      "Find our Indian culture around Goa",
      "Goa culture",
      "Museum has a few artifacts.",
      "To see portuguese lifestyle everybody must to visit this place.",
      "Good place for the persons with history related interests",
      "Highlights historical events of the beautiful State of Goa",
      "Rich heritage",
      "Captivating exhibits provide insightful glimpse into the past of Goa",
      "Archeological museum of Goan history, prehistory and history of Goan independence struggle.",
      "Knowledgeable for childrens.",
      "Old Hindu and Christian artifacts",
      "Museum has Portuguese, Christian, Printing History, Sculpture, Geology and many other Galleries",
      "Categorized them very well",
      "Museum with artifacts and the history of the area",
      "Goa is a beautiful state with a rich history as many places in India.",
      "It deserves a nice museum displaying the long history of the region.",
      "To know how smugglers are caught",
      "To know how custom officials are sincere and clever, alert and done good job",
      "Rich with the collection they have"
    ],
    "Value for Time & Money": [
      "nothing else to do for over staffed over security filled building",
      "Free of cost to visit",
      "Good job it's free because I was highly underwhelmed.",
      "Time waste",
      "Worth of knowledge",
      "Not worth the trouble.",
      "Not worth visiting"
    ],
    "Suitability for specific audiences": [
      "Good place for the persons with history related interests",
      "One must visit Museum of Goa",
      "Knowledgeable for childrens.",
      "Good place to visit with family specially kids"
    ],
    "Natural Beauty & Photogenic Spots": [
      "Surrounded by mangroves in back water of sea."
    ],
    "Wildlife & Biodiversity": [
      "Mangroves"
    ],
    "Adventure & Activities": [
      "Boat rides can also be taken from here.",
      "Defence jets."
    ],
    "Peace & Relaxation": [],
    "Shops & Stalls": [],
    "Food & Local Cuisine": [],
    "Events & Entertainment": [],
    "Navigation & Signage": [
      "The location on museum(Adhilshah palace) is very difficult to identify.",
      "that's not correctly pinned in maps.",
      "You have to put Goa museum, pnajim in google maps.",
      "There is no signage of Museum, but you can see the signage of Directorate of Museum which the museum and directorate works in the same building."
    ],
    "Transport Connectivity": [
      "The state museum is near to the Panjim bust stand"
    ],
    "Comparisons & Alternatives": [
      "Will remind you some places in Japan"
    ],
    "Local Tips & Insider Advice": [
      "Must visit place",
      "Must visit, it is near the Cruise entry gate",
      "Located centrally",
      "If you are nearby and need to pass time to wait for the churches to open at 3pm, it's not a bad way to spend 15 mins.",
      "But not recommended to intentionally go out of your way to visit.",
      "You may find people offering the boat rides in front of the Adil Shah Palace.",
      "Don't visit as there is nothing to see (as of November 2019).",
      "There's Adil Shah Palace to visit as well.",
      "Avoid at all costs."
    ],
    "Crowd Levels & Timing Suggestions": [
      "Visited on Weekday",
      "No wait",
      "Wait time: No wait",
      "Visited on Weekday",
      "Wait time: No wait",
      "Arrived at 13:55",
      "Visited on Weekday",
      "Wait time: Up to 10 min",
      "Visited on Public holiday",
      "Wait time: No wait",
      "It will take 30 to 45 mins",
      "It takes 10 minutes to see the whole museum.",
      "Wait time: 1 hr+",
      "One time to go",
      "Visited on Weekday",
      "Wait time: No wait",
      "Visitors are forced to enter their review/comment on the same register and it takes a while.",
      "Visited on Weekday",
      "Wait time: 30–60 min",
      "It takes more than half an hour to enter!",
      "Visited on Weekend",
      "Wait time: No wait",
      "Visited on Weekend",
      "Wait time: No wait",
      "Closed on Saturday and Sunday.",
      "Spent about 15 minutes looking around the museum.",
      "Visited on Weekday",
      "Wait time: No wait"
    ],
    "Weather & Best Season to Visit": [],
    "Accessibility & Mobility": [
      "Almost 1.8 km far from the previous location.",
      "Bit outside."
    ],
    "Safety & Security": [],
    "Tickets, Entry & Pricing": [
      "Free of cost to visit",
      "Free Entry in Goa State Museum",
      "Free to visit museum",
      "Good job it's free",
      "Free museum",
      "Free entry for all",
      "There is no entry fee.",
      "Goa museum is free.",
      "No foreign entry fee.",
      "Affordable entry fees",
      "No tickets / prices",
      "No entry charge required"
    ],
    "Signal Connectivity": [],
    "Spiritual or Religious Vibe": [],
    "Negative Aspects": [
      "Small collection",
      "thousands yet to be displayed articles lying within",
      "over staffed",
      "over security filled building",
      "sleeping 😴 or ignorant or no budget for real culture preservation display of artifacts?",
      "Unfortunately there is not much space to put all the art together. Many of them are in Godown and not in the showcase.",
      "Cannot call it a Museum just yet",
      "The actual Museum was moved to its temporary location because of ongoing maintenance and renovation at the actual location",
      "Not all the museum pieces were there",
      "Very small.",
      "For a rich heritage state like Goa this state museum could have been better",
      "You can cover the entire museum in 15-20 min it is that small",
      "For a state museum there was very minimal information",
      "highly underwhelmed",
      "This is a small mueseum now.",
      "hardly 15 items not more that.",
      "The building is completely demolished as of November 2019.",
      "This place does not exist (as of November 2019).",
      "It’s in very bad state.",
      "At present most of the exhibits are in a godown as there's not enough space to display everything.",
      "Needs a concept.",
      "Not enough pieces of art.",
      "Where did the museum funding go anyway? Into the pockets of politicians busy to fool the taxpayer?",
      "Museums should be upgraded to high level",
      "entry formalities where they ask for a government ID for every individual.",
      "Not too sure how the museum is, but if it is similar to the entry process - then it would be nothing much!",
      "The muséum is quite small.",
      "Not much else apart from Stone statues of Hindu Gods and Godesses"
    ],
    "Recommendations and Suggestions": [
      "Needs caring proud citizens to force The Deciders to spend money on Museum of the State",
      "Awaken !",
      "Reservation recommended: No",
      "Maybe once the Museum moves back to its original venue, the charm of seeing the history show pieces will come back.",
      "Reservation recommended: No",
      "Reservation recommended: No",
      "Make sure to see the woodwork items",
      "Can surely attract more footfalls than what it does currently.",
      "Reservation recommended: No",
      "We were told that they are in the process of expanding the place.",
      "Reservation recommended: Not sure",
      "Reservation recommended: No",
      "No photography was allowed but not really worth taking pictures.",
      "Reservation recommended: No"
    ],
    "Location & Setting": [
      "Situated at the heart of panaji city",
      "Established in 1971",
      "The artifacts have now been shifted from patto complex to adil shah palace, panaji.",
      "Now in panani",
      "In front of the adil shah palace, there are casinos.",
      "The building is completely demolished (as of November 2019).",
      "Empty ground (as of November 2019).",
      "Currently this building is changed to State library.",
      "The museum has been shifted to Adhilshah palace which is opposite to the Big Daddy casino."
    ]
  }
}